{
  "title": "Mission Control",
  "description": "Real-time operator interface for Delft Hyperloop’s pod at the SpaceX Hyperloop Pod Competition 2018, providing telemetry, navigation insights, and mission-critical commands.",
  "modal": {
    "title": "Mission Control",
    "intro": "Developed the real-time operator interface for Delft Hyperloop’s pod at the SpaceX Hyperloop Pod Competition (2018). Mission Control was the external half of the Communication System, working in tandem with the on-board Communication Hub. It collected live telemetry from 20+ sensor streams, visualized pod health within 30 seconds as required by SpaceX, and allowed operators to issue mission-critical commands such as launch and emergency stop.",
    "video": {
      "title": "Competition Aftermovie",
      "alt": "Delft Hyperloop Competition Aftermovie"
    },
    "technologies": {
      "title": "Technologies"
    },
    "features": {
      "title": "Key Features",
      "list": [
        "Live telemetry & health: Real-time dashboards showing 20+ sensor streams (IMU, encoder, reflective stripe detectors, brake pressures, BMS, temperatures, suspension) with color-coded status indicators.",
        "Command path with safety interlocks: Launch, state transitions, and Pod Stop with built-in safeguards; heartbeat monitoring triggered fail-safe braking on communication loss.",
        "Navigation awareness: Displayed position, velocity, and acceleration estimated through a Kalman filter, combining multiple sensor inputs with braking-point context.",
        "Anomaly visibility: Clear alarms, thresholds, and redundancy indicators for safety-critical systems such as brakes, propulsion, and batteries.",
        "Portable competition tool: Cross-platform Electron app designed for on-site use, integrated with SpaceX’s systems and backed by redundant logging."
      ]
    },
    "impact": {
      "title": "Impact",
      "text": [
        "Mission Control was the team’s primary interface for safe, high-speed runs. It enabled operators to verify pod health at a glance, react instantly to anomalies, and comply with competition rules (health display, external monitoring, remote stop, launch gating).",
        "The system was thoroughly validated through unit tests, end-to-end chain tests, and vacuum testing of the Communication Hub, ensuring reliability under competition conditions. In practice, Mission Control bridged deterministic control on the TI Hercules with flexible comms on the Raspberry Pi, providing the oversight that made safe high-performance testing possible."
      ]
    }
  }
}