{
  "title": "Mission Control",
  "description": "Real-time operator interface for Delft Hyperloop’s pod at the SpaceX Hyperloop Pod Competition 2018, providing telemetry, navigation insights, and mission-critical commands.",
  "modal": {
    "title": "Mission Control",
    "intro": "Developed the <1>real-time operator interface</1> for <1>Delft Hyperloop’s pod</1> at the <1>SpaceX Hyperloop Pod Competition (2018)</1>. Mission Control was the external half of the Communication System, working in tandem with the on-board Communication Hub. It collected <1>live telemetry from 20+ sensor streams</1>, visualized pod health within 30 seconds as required by SpaceX</1>, and allowed operators to issue <1>mission-critical commands</1> such as launch and emergency stop.",
    "video": {
      "title": "Competition Aftermovie",
      "alt": "Delft Hyperloop Competition Aftermovie"
    },
    "technologies": {
      "title": "Technologies"
    },
    "features": {
      "title": "Key Features",
      "list": [
        "<1>Live telemetry & health</1>: Real-time dashboards showing 20+ sensor streams (IMU, encoder, reflective stripe detectors, brake pressures, BMS, temperatures, suspension) with color-coded status indicators.",
        "<1>Command path with safety interlocks</1>: Launch, state transitions, and Pod Stop with built-in safeguards; <1>heartbeat monitoring triggered fail-safe braking</1> on communication loss.",
        "<1>Navigation awareness</1>: Displayed position, velocity, and acceleration estimated through a <1>Kalman filter</1>, combining multiple sensor inputs with braking-point context.",
        "<1>Anomaly visibility</1>: Clear alarms, thresholds, and redundancy indicators for safety-critical systems such as brakes, propulsion, and batteries.",
        "<1>Portable competition tool</1>: <1>Cross-platform Electron app</1> designed for on-site use, integrated with SpaceX’s systems and backed by redundant logging."
      ]
    },
    "impact": {
      "title": "Impact",
      "text": [
        "Mission Control was the team’s <1>primary interface for safe, high-speed runs</1>. It enabled operators to <1>verify pod health at a glance</1>, react instantly to anomalies, and comply with competition rules (health display, external monitoring, remote stop, launch gating).",
        "The system was <1>thoroughly validated</1> through unit tests, end-to-end chain tests, and vacuum testing of the Communication Hub, ensuring <1>reliability under competition conditions</1>. In practice, Mission Control bridged deterministic control on the TI Hercules with flexible comms on the Raspberry Pi, providing the <1>oversight that made safe high-performance testing possible</1>."
      ]
    }
  }
}